In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('salaries.csv')

In [3]:
df

   salary    name  age
0  120000    asif   56
1   30000  faisal   40
2   40000     evo  32s

In [6]:
df['salary']

0    120000
1     30000
2     40000
Name: salary, dtype: int64

In [7]:
# to get more than one coloum use two third bracket
# **** Two third bracket ***
df[['age', ' name']]

   age    name
0   56    asif
1   40  faisal
2  32s     evo

In [11]:
# we can use most of the numpy function in pandas
df['salary'].max()

120000

In [10]:
# get the basic statistical info of the dataframe
df.describe()

              salary
count       3.000000
mean    63333.333333
std     49328.828623
min     30000.000000
25%     35000.000000
50%     40000.000000
75%     80000.000000
max    120000.000000